vehicle/app/controllers/autos_controller.rb

  def index
    @autos = Auto.all
---
SELECT "autos".* FROM "autos"

  def create
    @auto = Auto.new(auto_params)

    respond_to do |format|
      if @auto.save
---
INSERT INTO "autos" ("modelo", "marca", "ano", "precio", "agencia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["modelo", "Ford"], ["marca", "Focus "], ["ano", 2000], ["precio", 0.0], ["agencia", "Neza"], ["created_at", "2016-05-17 21:48:16.611607"], ["updated_at", "2016-05-17 21:48:16.611607"]]

    def set_auto
      @auto = Auto.find(params[:id])
---
SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", 1]]