ggto/app/controllers/recipes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def recipeof
  @user_id = params[:user_id]
  @user = User.find(@user_id)

INSERT INTO "recipes" ("nam_recipes", "ingredients", "preparation", "preparation_time", "photo", "state", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save